stefanu21/cc3200/httpserver/main.c
        }
        break;

        case SL_NETAPP_HTTPPOSTTOKENVALUE_EVENT:
        {
          unsigned char led;
          unsigned char *ptr = pSlHttpServerEvent->EventData.httpPostData.token_name.data;


          if(memcmp(ptr, POST_DIM_token, strlen((const char *)POST_DIM_token)) == 0)
          {
            ptr = pSlHttpServerEvent->EventData.httpPostData.token_value.data;
            strLenVal = strlen(LED_STRING);
            if(memcmp(ptr, LED_STRING, strLenVal) != 0)
              break;
            ptr += strLenVal;
            led = *ptr;
            strLenVal = strlen(LED_POS_DIM_STRING);
			ptr += 2;  // nr + _

			switch (led) {
			case '1':
				if (memcmp(ptr, LED_POS_DIM_STRING, strLenVal) == 0) {
					dimpos1 += DIM_INC;
					Report("Led Red dim pos\n\r");

				} else {
					dimpos1 -= DIM_INC;
					Report("Led Red dimm neg\n\r");
				}

				if (dimpos1 >= 254)
					dimpos1 = 254;
				if (dimpos1 <= 0)
					dimpos1 = 0;
				UpdateDutyCycle(TIMERA3_BASE, TIMER_B, dimpos1);
				break;
			case '2':
				if (memcmp(ptr, LED_POS_DIM_STRING, strLenVal) == 0) {
					dimpos2 += DIM_INC;
					Report("Led Green dim pos\n\r");
				} else {
					dimpos2 -= DIM_INC;
					Report("Led Green dim neg\n\r");
				}
				if (dimpos2 >= 254)
					dimpos2 = 254;
				if (dimpos2 <= 0)
					dimpos2 = 0;
				UpdateDutyCycle(TIMERA3_BASE, TIMER_A, dimpos2);
				break;
			case '3':
				if (memcmp(ptr, LED_POS_DIM_STRING, strLenVal) == 0) {
					dimpos3 += DIM_INC;
					Report("Led Green On\n\r");
				} else {
					dimpos3 -= DIM_INC;
					Report("Led Green Off\n\r");
				}
				if (dimpos3 >= 254)
					dimpos3 = 254;
				if (dimpos3 <= 0)
					dimpos3 = 0;
				UpdateDutyCycle(TIMERA2_BASE, TIMER_B, dimpos3);
				break;
			default:
				Report("led unknown");
				break;
			}
          }
          if(memcmp(ptr, POST_token, strlen((const char *)POST_token)) == 0)
          {
            ptr = pSlHttpServerEvent->EventData.httpPostData.token_value.data;
            strLenVal = strlen(LED_STRING);
            if(memcmp(ptr, LED_STRING, strLenVal) != 0)
              break;
            ptr += strLenVal;
            led = *ptr;
            strLenVal = strlen(LED_ON_STRING);
			ptr += 2; // nr + _

			switch (led) {
			case '1':
				if (memcmp(ptr, LED_ON_STRING, strLenVal) == 0) {
		            UpdateDutyCycle(TIMERA3_BASE, TIMER_B, 254);
					Report("Led Red On\n\r");

				} else {
		            UpdateDutyCycle(TIMERA3_BASE, TIMER_B, 0);
					Report("Led Red Off\n\r");
				}
				break;
			case '2':
				if (memcmp(ptr, LED_ON_STRING, strLenVal) == 0) {
		            UpdateDutyCycle(TIMERA3_BASE, TIMER_A, 254);
					Report("Led Green On\n\r");
				} else {
		            UpdateDutyCycle(TIMERA3_BASE, TIMER_A, 0);
					Report("Led Green Off\n\r");
				}
				break;
			case '3':
				if (memcmp(ptr, LED_ON_STRING, strLenVal) == 0) {
		            UpdateDutyCycle(TIMERA2_BASE, TIMER_B, 254);
					Report("Led Green On\n\r");
				} else {
		            UpdateDutyCycle(TIMERA2_BASE, TIMER_B, 0);
					Report("Led Green Off\n\r");
				}
				break;
			default:
				Report("led unknown");
				break;
			}
		}
	}
		break;
	default:
		break;
    }
}


//*****************************************************************************
//
//! \brief This function initializes the application variables
//!
//! \param    None
//!
//! \return None
//!
//*****************************************************************************
static void InitializeAppVariables()
{
    g_ulStatus = 0;
    g_uiIpAddress = 0;
}


//*****************************************************************************
//! \brief This function puts the device in its default state. It:
//!           - Set the mode to STATION
//!           - Configures connection policy to Auto and AutoSmartConfig
//!           - Deletes all the stored profiles
//!           - Enables DHCP
//!           - Disables Scan policy
//!           - Sets Tx power to maximum
//!           - Sets power policy to normal
//!           - Unregister mDNS services
//!           - Remove all filters
//!
//! \param   none
//! \return  On success, zero is returned. On error, negative is returned
//*****************************************************************************
static long ConfigureSimpleLinkToDefaultState()
{
    SlVersionFull   ver = {0};
    _WlanRxFilterOperationCommandBuff_t  RxFilterIdMask = {0};

    unsigned char ucVal = 1;
    unsigned char ucConfigOpt = 0;
    unsigned char ucConfigLen = 0;
    unsigned char ucPower = 0;

    long lRetVal = -1;
    long lMode = -1;

    lMode = sl_Start(0, 0, 0);
    ASSERT_ON_ERROR(lMode);

    // If the device is not in station-mode, try configuring it in station-mode 
    if (ROLE_STA != lMode)
    {
        if (ROLE_AP == lMode)
        {
            // If the device is in AP mode, we need to wait for this event 
            // before doing anything 
            while(!IS_IP_ACQUIRED(g_ulStatus))
            {
#ifndef SL_PLATFORM_MULTI_THREADED
              _SlNonOsMainLoopTask(); 
#endif
            }
        }

        // Switch to STA role and restart 
        lRetVal = sl_WlanSetMode(ROLE_STA);
        ASSERT_ON_ERROR(lRetVal);

        lRetVal = sl_Stop(0xFF);
        ASSERT_ON_ERROR(lRetVal);

        lRetVal = sl_Start(0, 0, 0);
        ASSERT_ON_ERROR(lRetVal);

        // Check if the device is in station again 
        if (ROLE_STA != lRetVal)
        {
        	Report("device not in station mode");
            // We don't want to proceed if the device is not coming up in STA-mode 
            return DEVICE_NOT_IN_STATION_MODE;
        }
    }
    
    // Get the device's version-information
    ucConfigOpt = SL_DEVICE_GENERAL_VERSION;
    ucConfigLen = sizeof(ver);
    lRetVal = sl_DevGet(SL_DEVICE_GENERAL_CONFIGURATION, &ucConfigOpt, 
                                &ucConfigLen, (unsigned char *)(&ver));
    ASSERT_ON_ERROR(lRetVal);
    
    UART_PRINT("Host Driver Version: %s\n\r",SL_DRIVER_VERSION);
    UART_PRINT("Build Version %d.%d.%d.%d.31.%d.%d.%d.%d.%d.%d.%d.%d\n\r",
    ver.NwpVersion[0],ver.NwpVersion[1],ver.NwpVersion[2],ver.NwpVersion[3],
    ver.ChipFwAndPhyVersion.FwVersion[0],ver.ChipFwAndPhyVersion.FwVersion[1],
    ver.ChipFwAndPhyVersion.FwVersion[2],ver.ChipFwAndPhyVersion.FwVersion[3],
    ver.ChipFwAndPhyVersion.PhyVersion[0],ver.ChipFwAndPhyVersion.PhyVersion[1],
    ver.ChipFwAndPhyVersion.PhyVersion[2],ver.ChipFwAndPhyVersion.PhyVersion[3]);

    // Set connection policy to Auto + SmartConfig 
    //      (Device's default connection policy)
    lRetVal = sl_WlanPolicySet(SL_POLICY_CONNECTION, 
                                SL_CONNECTION_POLICY(1, 0, 0, 0, 1), NULL, 0);
    ASSERT_ON_ERROR(lRetVal);

